{"id": "a8a920d7-4ae8-49f9-801c-f9c489ec537f", "name": "SIGMA - Linux Local Lateral Movement www-data Switch User Activity", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects Linux Switch User (su) activity from the web server www-data user logging into a different local account.", "rule_id": "a8a920d7-4ae8-49f9-801c-f9c489ec537f", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1078", "reference": "https://attack.mitre.org/techniques/T1078", "name": "Valid Accounts", "subtechnique": [{"id": "T1078.003", "reference": "https://attack.mitre.org/techniques/T1078/003", "name": "Local Accounts"}]}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where event.action:\"logged-on\" and user.id:\"33\" and log.syslog.appname:\"su\"", "filters": [], "actions": []}
