{"actions": [], "author": ["Dylan Shield (Shieldi.co)"], "description": "Detects suspicious directory access assosiated with User-Agent based obfuscated Nmap scans", "enabled": true, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "020c4ad7-2ea1-428c-9fb1-19a3f9965483", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Obfuscated Nmap Scan", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where url.original like \"*/nmaplowercheck*\" and not user_agent.original like \"*Nmap Scripting Engine*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "020c4ad7-2ea1-428c-9fb1-19a3f9965483", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.002", "name": "Vulnerability Scanning", "reference": "https://attack.mitre.org/techniques/T1595/002"}]}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0006", "name": "Credential-Access", "reference": "https://attack.mitre.org/tactics/TA0006"}, "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}
