title: Base Rule - Web Apache Correlation Obfuscated Nmap Scan 
id: ad5f5e6f-5622-4e81-872a-f38d28630a5e
status: experimental
name: base_rule_web_apache_correlation_obf_nmap_scan
description: Detects suspicious directory access assosiated with User-Agent based obfuscated Nmap scans
author: Dylan Shield (Shieldia.co)
date: 2025-10-16
tags:
    - attack.reconnaissance
    - attack.t1595.002
    - attack.initial-access
    - attack.t1190
    - attack.credential-access
    - attack.t1110
logsource:
    product: apache
    service: access
    category: webserver
detection:
    selection:
        c-url|contains: '/nmaplowercheck'
    user_agent_filter:
        c-useragent|contains:
            - 'Nmap Scripting Engine'
    condition: selection and not user_agent_filter
falsepositives:
    - Unknown
level: medium
---
title: Web Apache Correlation Obfuscated Nmap Scan
id: 020c4ad7-2ea1-428c-9fb1-19a3f9965483
status: experimental
name: web_apache_correlation_obf_nmap_scan
description: Detects suspicious directory access assosiated with User-Agent based obfuscated Nmap scans
author: Dylan Shield (Shieldi.co)
date: 2025-10-16
tags:
    - attack.reconnaissance
    - attack.t1595.002
    - attack.initial-access
    - attack.t1190
    - attack.credential-access
    - attack.t1110
logsource:
    product: apache
    service: access
    category: webserver
correlation:
    type: value_count
    rules:
    - base_rule_web_apache_correlation_obf_nmap_scan
    group-by:
        - clientip
        - host
    timespan: 5m
    condition:
        gte: 1
        field: c-url
falsepositives:
  - Unlikely
level: medium
