{"id": "445ee18e-b50d-4556-ab53-8eaf08b64ab6", "name": "SIGMA - Suspicious Process Spawned by Node", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects successful Node RCE via shell commands", "rule_id": "445ee18e-b50d-4556-ab53-8eaf08b64ab6", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 99, "severity": "critical", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": ["cve-2025-55182"], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (process.parent.name:\"node\" and process.parent.args regex~ \".*start.*\" and process.command_line regex~ \".*sh -c.*\") and (not (process.command_line regex~ \".*git config.*\" or process.command_line regex~ \".*next start.*\"))", "filters": [], "actions": []}
