title: Win System Install Service
id: e5f2c8f8-1fb7-4959-b93d-e4921ea8b8f1
status: experimental
description: Detects the installation of a service on a Windows host
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/7e11e9b79583545f208a6dc3fa062f2ed443d999/atomics/T1543.003/T1543.003.md#atomic-test-3---service-installation-powershell
    - https://www.ryadel.com/en/windows-services-full-list-shortname-displayname/
author: Dylan Shield (Shieldia.co)
date: 2024-05-06
tags:
    - attack.persistence
    - attack.t1543.003
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
    filter:
      ServiceName:
        - 'AxInstSV'
        - 'SensrSvc'
        - 'AeLookupSvc'
        - 'AppHostSvc'
        - 'AppIDSvc'
        - 'Appinfo'
        - 'ALG'
        - 'AppMgmt'
        - 'aspnet_state'
        - 'BITS'
        - 'BFE'
        - 'BDESVC'
        - 'wbengine'
        - 'bthserv'
        - 'PeerDistSvc'
        - 'CertPropSvc'
        - 'NfsClnt'
        - 'KeyIso'
        - 'EventSystem'
        - 'COMSysApp'
        - 'Browser'
        - 'VaultSvc'
        - 'CryptSvc'
        - 'DcomLaunch'
        - 'UxSms'
        - 'Dhcp'
        - 'DPS'
        - 'WdiServiceHost'
        - 'WdiSystemHost'
        - 'defragsvc'
        - 'TrkWks'
        - 'MSDTC'
        - 'Dnscache'
        - 'EFS'
        - 'EapHost'
        - 'Fax'
        - 'fdPHost'
        - 'FDResPub'
        - 'gpsvc'
        - 'hkmsvc'
        - 'HomeGroupListener'
        - 'HomeGroupProvider'
        - 'hidserv'
        - 'IISADMIN'
        - 'IKEEXT'
        - 'CISVC'
        - 'UI0Detect'
        - 'SharedAccess'
        - 'iphlpsvc'
        - 'PolicyAgent'
        - 'KtmRm'
        - 'lltdsvc'
        - 'LPDSVC'
        - 'Mcx2Svc'
        - 'MSMQ'
        - 'MSMQTriggers'
        - 'clr_optimization_v2.0.50727'
        - 'ftpsvc'
        - 'MSiSCSI'
        - 'swprv'
        - 'MMCSS'
        - 'NetMsmqActivator'
        - 'NetPipeActivator'
        - 'NetTcpActivator'
        - 'NetTcpPortSharing'
        - 'Netlogon'
        - 'napagent'
        - 'Netman'
        - 'netprofm'
        - 'NlaSvc'
        - 'nsi'
        - 'CscService'
        - 'WPCSvc'
        - 'PNRPsvc'
        - 'p2psvc'
        - 'p2pimsvc'
        - 'pla'
        - 'PlugPlay'
        - 'IPBusEnum'
        - 'PNRPAutoReg'
        - 'WPDBusEnum'
        - 'Power'
        - 'Spooler'
        - 'wercplsupport'
        - 'PcaSvc'
        - 'ProtectedStorage'
        - 'QWAVE'
        - 'RasAuto'
        - 'RasMan'
        - 'SessionEnv'
        - 'TermService'
        - 'UmRdpService'
        - 'RpcSs'
        - 'RpcLocator'
        - 'RemoteRegistry'
        - 'iprip'
        - 'RemoteAccess'
        - 'RpcEptMapper'
        - 'SeaPort'
        - 'seclogon'
        - 'SstpSvc'
        - 'SamSs'
        - 'wscsvc'
        - 'LanmanServer'
        - 'ShellHWDetection'
        - 'simptcp'
        - 'SCardSvr'
        - 'SCPolicySvc'
        - 'SNMP'
        - 'SNMPTRAP'
        - 'sppsvc'
        - 'sppuinotify'
        - 'SSDPSRV'
        - 'StorSvc'
        - 'SysMain'
        - 'SENS'
        - 'TabletInputService'
        - 'Schedule'
        - 'lmhosts'
        - 'TapiSrv'
        - 'TlntSvr'
        - 'Themes'
        - 'THREADORDER'
        - 'TBS'
        - 'upnphost'
        - 'ProfSvc'
        - 'vds'
        - 'VSS'
        - 'WMSVC'
        - 'WebClient'
        - 'AudioSrv'
        - 'AudioEndpointBuilder'
        - 'SDRSVC'
        - 'WbioSrvc'
        - 'idsvc'
        - 'WcsPlugInService'
        - 'wcncsvc'
        - 'WinDefend'
        - 'wudfsvc'
        - 'WerSvc'
        - 'Wecsvc'
        - 'EventLog'
        - 'MpsSvc'
        - 'FontCache'
        - 'StiSvc'
        - 'msiserver'
        - 'fsssvc'
        - 'Winmgmt'
        - 'ehRecvr'
        - 'ehSched'
        - 'WMPNetworkSvc'
        - 'TrustedInstaller'
        - 'FontCache3.0.0.0'
        - 'WAS'
        - 'WinRM'
        - 'WSearch'
        - 'W32Time'
        - 'wuauserv'
        - 'WinHttpAutoProxySvc'
        - 'dot3svc'
        - 'Wlansvc'
        - 'wmiApSrv'
        - 'LanmanWorkstation'
        - 'W3SVC'
        - 'WwanSvc'
    condition: selection and not filter
falsepositives:
  - Legitimate service installation
level: low
