{"id": "f4281164-f2fa-4f9b-b4cc-7af4ab73482a", "name": "SIGMA - Suspicious Process Spawned by Apache with Shell Metacharacters", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects successful Apache command injection via shell metacharacters", "rule_id": "f4281164-f2fa-4f9b-b4cc-7af4ab73482a", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where process.parent.name:\"apache2\" and process.command_line regex~ \".*[;|&`><$()].*\"", "filters": [], "actions": []}
{"id": "0ec89dec-2496-47d3-af64-b35baea12b49", "name": "SIGMA - Linux Process Creation Web Reverse Shell", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect a reverse shell via username and commandline args, like the auditd rule", "rule_id": "0ec89dec-2496-47d3-af64-b35baea12b49", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1203", "reference": "https://attack.mitre.org/techniques/T1203", "name": "Exploitation for Client Execution", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where user.name:\"www-data\" and process.command_line:\"*sh -i*\"", "filters": [], "actions": []}
{"id": "c9fd12ee-2cd4-44e0-8909-53b5044ad711", "name": "SIGMA - SQLite Firefox Profile Data DB Access", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect usage of the \"sqlite\" binary to query Firefox databases for potential data stealing.", "rule_id": "c9fd12ee-2cd4-44e0-8909-53b5044ad711", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0006", "reference": "https://attack.mitre.org/tactics/TA0006", "name": "Credential-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1539", "reference": "https://attack.mitre.org/techniques/T1539", "name": "Steal Web Session Cookie", "subtechnique": []}]}, {"tactic": {"id": "TA0009", "reference": "https://attack.mitre.org/tactics/TA0009", "name": "Collection"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1555", "reference": "https://attack.mitre.org/techniques/T1555", "name": "Credentials from Password Stores", "subtechnique": [{"id": "T1555.003", "reference": "https://attack.mitre.org/techniques/T1555/003", "name": "Credentials from Web Browsers"}]}]}], "tags": [], "to": "now", "references": ["https://www.mozilla.org/en-US/firefox/", "https://support.mozilla.org/en-US/kb/profiles-where-firefox-stores-user-data"], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where (process.name:\"SQLite\" or (process.executable like~ (\"*\\\\sqlite.exe\", \"*\\\\sqlite3.exe\"))) and (process.command_line like~ (\"*\\\\Mozilla\\\\Firefox\\\\Profiles\\\\*\", \"*\\\\AppData\\\\Roaming\\\\Mozilla\\\\Firefox\\\\Profiles\\\\*\")) and (process.command_line like~ (\"*cookies.sqlite*\", \"*places.sqlite*\", \"*formhistory.sqlite*\", \"*webappsstore.sqlite*\"))", "filters": [], "actions": []}
