{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect an attempt to brute force a webserver by the method and username and password in url paramiters\nRun this ES|QL search to get targeted users:\nFROM logs-apache.access-default\n| WHERE http.request.method == \"GET\" AND url.query LIKE \"*username=*\" AND url.query LIKE \"*password=*\" AND url.query LIKE \"*Login=*\"\n| EVAL username = split(url.query,\"\u0026\")\n| STATS attempt_count = COUNT(url.query) BY username\n| EVAL valid = CASE (starts_with(username, \"username=\"),true)\n| WHERE valid\n| EVAL user = REPLACE(username,\"username=\", \"\")\n| SORT attempt_count DESC\n| WHERE attempt_count \u003e 10\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "42d3a802-e574-486d-8b3a-cf5a1057d263", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Brute Force GET", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==200 and url.original like \"*username=*\" and url.original like \"*password=*\" and url.original like \"*Login=*\"\n| eval timebucket=date_trunc(1minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 20", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "42d3a802-e574-486d-8b3a-cf5a1057d263", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect an attempt to brute force a webserver by the method and username and password in url paramiters\n", "enabled": false, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "85a41780-774d-40e5-98aa-c6fef9f2853f", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - Web Apache Correlation Brute Force GET", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==200 and url.original like \"*username=*\" and url.original like \"*password=*\" and url.original like \"*Login=*\"\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 10", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "85a41780-774d-40e5-98aa-c6fef9f2853f", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect directory Enumeration by the number of 404 responces from a single source to a single destination\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "289a3330-7141-4117-8691-3db7c7e69364", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Directory Enumeration", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==404\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 1000", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "289a3330-7141-4117-8691-3db7c7e69364", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect directory Enumeration by the number of 404 responces from a single source to a single destination\n", "enabled": false, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "a8aa9af9-c3ea-4fb9-999b-a6fcb0d53abd", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - Web Apache Correlation Directory Enumeration", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==404\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(url.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 200", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "a8aa9af9-c3ea-4fb9-999b-a6fcb0d53abd", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect suspicius User-Agnets in Apache Web Server logs from a single source to a single destination\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "6b5a3259-9381-46e4-a507-bd45bb5e9d28", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Hack Tool User Agent", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where user_agent.original like \"*Nmap Scripting Engine*\" or user_agent.original like \"*Fuzz Faster U Fool*\" or user_agent.original like \"*OpenVAS*\" or user_agent.original like \"*Nikto*\" or user_agent.original like \"*Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36*\" or user_agent.original like \"*(hydra)*\" or user_agent.original like \"* arachni/*\" or user_agent.original like \"* BFAC *\" or user_agent.original like \"* brutus *\" or user_agent.original like \"* cgichk *\" or user_agent.original like \"*core-project/1.0*\" or user_agent.original like \"* crimscanner/*\" or user_agent.original like \"*datacha0s*\" or user_agent.original like \"*DirBuster*\" or user_agent.original like \"*domino hunter*\" or user_agent.original like \"*dotdotpwn*\" or user_agent.original like \"*FHScan Core*\" or user_agent.original like \"*floodgate*\" or user_agent.original like \"*get-minimal*\" or user_agent.original like \"*gootkit auto-rooter scanner*\" or user_agent.original like \"*grendel-scan*\" or user_agent.original like \"* inspath *\" or user_agent.original like \"*internet ninja*\" or user_agent.original like \"*jaascois*\" or user_agent.original like \"* zmeu *\" or user_agent.original like \"*masscan*\" or user_agent.original like \"* metis *\" or user_agent.original like \"*morfeus fucking scanner*\" or user_agent.original like \"*n-stealth*\" or user_agent.original like \"*nsauditor*\" or user_agent.original like \"*pmafind*\" or user_agent.original like \"*security scan*\" or user_agent.original like \"*springenwerk*\" or user_agent.original like \"*teh forest lobster*\" or user_agent.original like \"*toata dragostea*\" or user_agent.original like \"* vega/*\" or user_agent.original like \"*voideye*\" or user_agent.original like \"*webshag*\" or user_agent.original like \"*webvulnscan*\" or user_agent.original like \"* whcc/*\" or user_agent.original like \"* Havij*\" or user_agent.original like \"*absinthe*\" or user_agent.original like \"*bsqlbf*\" or user_agent.original like \"*mysqloit*\" or user_agent.original like \"*pangolin*\" or user_agent.original like \"*sql power injector*\" or user_agent.original like \"*sqlmap*\" or user_agent.original like \"*sqlninja*\" or user_agent.original like \"*uil2pn*\" or user_agent.original like \"*ruler*\" or user_agent.original like \"*Mozilla/5.0 (Windows; U; Windows NT 5.1; pt-PT; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2 (.NET CLR 3.5.30729)*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(user_agent.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "6b5a3259-9381-46e4-a507-bd45bb5e9d28", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.002", "name": "Vulnerability Scanning", "reference": "https://attack.mitre.org/techniques/T1595/002"}]}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0006", "name": "Credential-Access", "reference": "https://attack.mitre.org/tactics/TA0006"}, "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects path traversal exploitation attempts\n", "enabled": true, "exceptions_list": [], "false_positives": ["Expected to be continuously seen on systems exposed to the Internet", "Internal vulnerability scanners"], "from": "now-9m", "id": "5a06ded0-5111-45c9-a8fd-bd8d6d3ecefc", "immutable": false, "index": [], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Path Traversal Exploitation Attempts", "note": "", "output_index": "", "query": "from * metadata _id, _index, _version | where url.query like \"*../../../../../lib/password*\" or url.query like \"*../../../../windows/*\" or url.query like \"*../../../etc/*\" or url.query like \"*..%252f..%252f..%252fetc%252f*\" or url.query like \"*..%c0%af..%c0%af..%c0%afetc%c0%af*\" or url.query like \"*%252e%252e%252fetc%252f*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": ["https://github.com/projectdiscovery/nuclei-templates", "https://book.hacktricks.xyz/pentesting-web/file-inclusion"], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "5a06ded0-5111-45c9-a8fd-bd8d6d3ecefc", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects potential SQL injection attempts via GET requests in access logs.\n", "enabled": true, "exceptions_list": [], "false_positives": ["Java scripts and CSS Files", "User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "from": "now-9m", "id": "ac762709-a61b-4528-b7b5-725dd1406fa3", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - SQL Injection Strings In URI", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and (url.query like \"*@@version*\" or url.query like \"*@@VERSION*\" or url.query like \"*%271%27%3D%271*\" or url.query like \"*=select *\" or url.query like \"*=select(*\" or url.query like \"*=select%20*\" or url.query like \"*concat_ws(*\" or url.query like \"*CONCAT(0x*\" or url.query like \"*from mysql.innodb_table_stats*\" or url.query like \"*from%20mysql.innodb_table_stats*\" or url.query like \"*group_concat(*\" or url.query like \"*information_schema.tables*\" or url.query like \"*json_arrayagg(*\" or url.query like \"*or 1=1#*\" or url.query like \"*or%201=1#*\" or url.query like \"*order by *\" or url.query like \"*order%20by%20*\" or url.query like \"*select * *\" or url.query like \"*select database()*\" or url.query like \"*select version()*\" or url.query like \"*select%20*%20*\" or url.query like \"*select%20database()*\" or url.query like \"*select%20version()*\" or url.query like \"*select%28sleep%2810%29*\" or url.query like \"*SELECTCHAR(*\" or url.query like \"*table_schema*\" or url.query like \"*UNION ALL SELECT*\" or url.query like \"*UNION SELECT*\" or url.query like \"*UNION%20ALL%20SELECT*\" or url.query like \"*UNION%20SELECT*\" or url.query like \"*\u00271\u0027=\u00271*\" or url.query like \"*+or+0%3D0+%23*\" or url.query like \"*+or+%277659%27%3D%277659*\" or url.query like \"*+or+1%3D1+or+%27%27%3D%27*\" or url.query like \"*+or+%271%27%3D%271*\" or url.query like \"*or+0%3D0+%23%22*\" or url.query like \"*+or+1+--%27*\" or url.query like \"*+or+%27%27%3D%27*\" or url.query like \"*+or+%27a%27%3D%27a*\" or url.query like \"*%7C%7C%276*\" or url.query like \"*or+0%3D0+%23*\" or url.query like \"*+or+0%3D0+%23%22*\") and not http.response.status_code==404\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": ["https://www.acunetix.com/blog/articles/exploiting-sql-injection-example/", "https://www.acunetix.com/blog/articles/using-logs-to-investigate-a-web-application-attack/", "https://brightsec.com/blog/sql-injection-payloads/", "https://github.com/payloadbox/sql-injection-payload-list", "https://book.hacktricks.xyz/pentesting-web/sql-injection/mysql-injection"], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "ac762709-a61b-4528-b7b5-725dd1406fa3", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects File Inclusion attempts in apache error logs\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "dc8e43d1-3103-4fd9-8eb8-1a150a474c3b", "immutable": false, "index": ["logs-apache.error-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Error Correlation File Inclusion", "note": "", "output_index": "", "query": "from logs-apache.error-default metadata _id, _index, _version | where message like \"*Failed opening*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(message) by timebucket, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "dc8e43d1-3103-4fd9-8eb8-1a150a474c3b", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect Remote File Inclusion attempts in webserver logs via URI parameters containing `http(s)` or an IPv4 address or a domain name", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "5d649859-f4ac-4158-a5b7-e8321f5d155b", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Remote File Inclusion Attempt", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where url.query rlike \"(.*)http(s?)(.*)\" or url.query rlike \"(.*)(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])(.*)\" or url.query rlike \".*\\\\.(com|net|org|gov|edu|io|dev|arpa|local|test|home|biz|info|co|us|uk|de|fr|jp|ca|au|nz|eu|cn|in)/(.*)|.*\\\\.(com|net|org|gov|edu|io|dev|arpa|local|test|home|biz|info|co|us|uk|de|fr|jp|ca|au|nz|eu|cn|in)\"", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "5d649859-f4ac-4158-a5b7-e8321f5d155b", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect User-Agent based Cross Site Scripting attempt in webserver logs", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "eb686504-6c0f-4dfd-9493-5f8b3dcd84aa", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache XSS in User-Agent Attempt", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where user_agent.original like \"*\u003cscript\u003e*\" or user_agent.original like \"*\u003c/*\" or user_agent.original like \"*alert(*\"", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "eb686504-6c0f-4dfd-9493-5f8b3dcd84aa", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}
{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect blocked network events from a single source to a single destination via a single observer on over 1000 unique ports over 5 minutes\n", "enabled": true, "exceptions_list": [], "false_positives": ["Likely", "Internal vulnrability scanners such as Nessus do port scanning to verify what ports are open on the target"], "from": "now-9m", "id": "0c61e4ef-b201-4f9c-847f-f6ec9c7c3aaa", "immutable": false, "index": ["logs-pfsense.log-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - pfSense Correlation Port Scan Activity", "note": "", "output_index": "", "query": "from logs-pfsense.log-default metadata _id, _index, _version | where event.action==\"block\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(destination.port) by timebucket, source.ip, destination.ip, observer.name\n| where value_count \u003e= 1000", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 21, "risk_score_mapping": [], "rule_id": "0c61e4ef-b201-4f9c-847f-f6ec9c7c3aaa", "setup": "", "severity": "low", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}

{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect blocked network events from a single source to a single destination via a single observer on over 200 unique ports over a month\n", "enabled": false, "exceptions_list": [], "false_positives": ["Likely", "Internal vulnrability scanners such as Nessus do port scanning to verify what ports are open on the target"], "from": "now-9m", "id": "a56c2e3e-0316-11f0-924f-080027ccddfd", "immutable": false, "index": ["logs-pfsense.log-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - pfSense Correlation Port Scan Activity", "note": "", "output_index": "", "query": "from logs-pfsense.log-default metadata _id, _index, _version | where event.action==\"block\"\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(destination.port) by timebucket, source.ip, destination.ip, observer.name\n| where value_count \u003e= 200", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 21, "risk_score_mapping": [], "rule_id": "a56c2e3e-0316-11f0-924f-080027ccddfd", "setup": "", "severity": "low", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}
