{"actions":[],"author":["Dylan Shield (Shieldia.co)"],"description":"Detect a reverse shell via username and commandline args, like the auditd rule","enabled":true,"exceptions_list":[],"false_positives":["Unknown"],"filters":[],"from":"now-5m","id":"0ec89dec-2496-47d3-af64-b35baea12b49","immutable":false,"index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"interval":"5m","language":"eql","license":"DRL","max_signals":100,"meta":{"from":"1m"},"name":"SIGMA - Linux Process Creation Web Reverse Shell","output_index":"","query":"any where user.name:\"www-data\" and (process.command_line regex~ \"sh -i\" or process.command_line regex~ \"sh -c (ba)?sh.*\\\\<\\\\&.*\" or process.command_line regex~ \"sh -c (ba)?sh.*\\\\>\\\\&.*\")","references":[],"related_integrations":[],"required_fields":[],"risk_score":73,"risk_score_mapping":[],"rule_id":"0ec89dec-2496-47d3-af64-b35baea12b49","setup":"","severity":"high","severity_mapping":[],"tags":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002"},"technique":[{"id":"T1203","name":"Exploitation for Client Execution","reference":"https://attack.mitre.org/techniques/T1203","subtechnique":[]}]}],"throttle":"no_actions","to":"now","type":"eql","version":1}
