{"id": "746ad7b5-a86d-4196-a901-0a7316aea5b6", "name": "SIGMA - Suspicious Process Spawned by Apache with Shell Metacharacters Med Sec", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects successful Apache command injection via shell metacharacters", "rule_id": "746ad7b5-a86d-4196-a901-0a7316aea5b6", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0001", "reference": "https://attack.mitre.org/tactics/TA0001", "name": "Initial-Access"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1190", "reference": "https://attack.mitre.org/techniques/T1190", "name": "Exploit Public-Facing Application", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where user.name:\"www-data\" and process.command_line regex~ \".*[;|&`><$()].*\"", "filters": [], "actions": []}
