title: Suspicious Process Spawned by Apache with Shell Metacharacters
id: f4281164-f2fa-4f9b-b4cc-7af4ab73482a
status: experimental
name: linux_process_creation_apache_command_injection
description: Detects successful Apache command injection via shell metacharacters
author: Dylan Shield (Shieldia.co)
date: 2025-03-24
tags:
    - attack.initial-access
    - attack.t1190
logsource:
  category: process_creation
  product: linux
detection:
  selection_parent:
    ParentProcessName: apache2
  selection_args:
    CommandLine|re: '.*[;|&`><$()].*'
  condition: selection_parent and selection_args
falsepositives:
    - Unknown
level: high