{"id": "0ec89dec-2496-47d3-af64-b35baea12b49", "name": "SIGMA - Linux Process Creation Web Reverse Shell", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect a reverse shell via username and commandline args, like the auditd rule", "rule_id": "0ec89dec-2496-47d3-af64-b35baea12b49", "false_positives": ["Unknown"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 73, "severity": "high", "risk_score_mapping": [], "severity_mapping": [], "threat": [{"tactic": {"id": "TA0002", "reference": "https://attack.mitre.org/tactics/TA0002", "name": "Execution"}, "framework": "MITRE ATT&CK", "technique": [{"id": "T1203", "reference": "https://attack.mitre.org/techniques/T1203", "name": "Exploitation for Client Execution", "subtechnique": []}]}], "tags": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where user.name:\"www-data\" and process.command_line:\"*sh -i*\"", "filters": [], "actions": []}