title: Linux Process Creation Web Reverse Shell
id: 0ec89dec-2496-47d3-af64-b35baea12b49
status: experimental
name: linux_process_creation_web_reverse_shell
description: Detect a reverse shell via username and commandline args, like the auditd rule
author: Dylan Shield (Shieldia.co)
date: 2025-03-31
modified: 2025-05-28
tags:
    - attack.execution
    - attack.t1203
logsource:
  category: process_creation
  product: linux
detection:
    selection:
        User:
            - 'www-data'
        CommandLine|re:
            - 'sh -i'
            - 'sh -c (ba?)sh.*\\<\\&.*'
            - 'sh -c (ba?)sh.*\\>\\&.*'
    condition: selection
falsepositives:
    - Unknown
level: high