{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect blocked network events from a single source to a single destination via a single observer on over 200 unique ports over a month\n", "enabled": false, "exceptions_list": [], "false_positives": ["Likely", "Internal vulnrability scanners such as Nessus do port scanning to verify what ports are open on the target"], "from": "now-9m", "id": "a56c2e3e-0316-11f0-924f-080027ccddfd", "immutable": false, "index": ["logs-pfsense.log-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - pfSense Correlation Port Scan Activity", "note": "", "output_index": "", "query": "from logs-pfsense.log-default metadata _id, _index, _version | where event.action==\"block\"\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(destination.port) by timebucket, source.ip, destination.ip, observer.name\n| where value_count \u003e= 200", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 21, "risk_score_mapping": [], "rule_id": "a56c2e3e-0316-11f0-924f-080027ccddfd", "setup": "", "severity": "low", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}