{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect an attempt to brute force a webserver by the method and username and password in url paramiters\n", "enabled": false, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "85a41780-774d-40e5-98aa-c6fef9f2853f", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - Web Apache Correlation Brute Force GET", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==200 and url.original like \"*username=*\" and url.original like \"*password=*\" and url.original like \"*Login=*\"\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 10", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "85a41780-774d-40e5-98aa-c6fef9f2853f", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}