{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Correlation rule to detect directory Enumeration by the number of 404 responces from a single source to a single destination\n", "enabled": false, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "a8aa9af9-c3ea-4fb9-999b-a6fcb0d53abd", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Threat Hunt - Web Apache Correlation Directory Enumeration", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and http.response.status_code==404\n| eval timebucket=date_trunc(1days, @timestamp) | stats value_count=count_distinct(url.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 200", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "a8aa9af9-c3ea-4fb9-999b-a6fcb0d53abd", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.001", "name": "Scanning IP Blocks", "reference": "https://attack.mitre.org/techniques/T1595/001"}]}]}], "to": "now", "type": "esql", "version": 1}