title: Web Apache XSS in User-Agent Attempt
id: eb686504-6c0f-4dfd-9493-5f8b3dcd84aa
status: experimental
name: web_apache_xss_ua_attempt
description: Detect User-Agent based Cross Site Scripting attempt in webserver logs
author: Dylan Shield (Shieldia.co)
date: 2025-03-30
tags:
    - attack.initial-access
    - attack.t1190
logsource:
    product: apache
    service: access
    category: webserver
detection:
    selection:
        useragent|contains:
            - '<script>'
            - '</'
            - 'alert('
    condition: selection
falsepositives:
    - Unknown
level: high