{"actions": [], "author": ["Saw Win Naung, Nasreddine Bencherchali, Dylan Shield (Shieldia.co)"], "description": "Detects potential XSS attempts via GET requests in access logs.\n", "enabled": true, "exceptions_list": [], "false_positives": ["JavaScripts,CSS Files and PNG files", "User searches in search boxes of the respective website", "Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as \"User Agent\" strings and more response codes"], "from": "now-9m", "id": "3dc5b535-a209-4654-bf9e-239f2b21d7f4", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Cross Site Scripting Strings", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where http.request.method==\"GET\" and (url.query like \"*=\u003cscript\u003e*\" or url.query like \"*\u003c/script\u003e*\" or url.query like \"*=%3Cscript%3E*\" or url.query like \"*=%253Cscript%253E*\" or url.query like \"*\u003ciframe *\" or url.query like \"*%3Ciframe *\" or url.query like \"*\u003csvg *\" or url.query like \"*%3Csvg *\" or url.query like \"*document.cookie*\" or url.query like \"*document.domain*\" or url.query like \"* onerror=*\" or url.query like \"* onresize=*\" or url.query like \"* onload=\\\"*\" or url.query like \"*onmouseover=*\" or url.query like \"*${alert*\" or url.query like \"*javascript:alert*\" or url.query like \"*javascript%3Aalert*\") and not http.response.status_code==404\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": ["https://github.com/payloadbox/xss-payload-list", "https://portswigger.net/web-security/cross-site-scripting/contexts"], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "3dc5b535-a209-4654-bf9e-239f2b21d7f4", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1189", "name": "Drive-by Compromise", "reference": "https://attack.mitre.org/techniques/T1189", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}