{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect Open HTTP Redirect attempts in webserver logs via URI parameters containing `http(s)` or an IPv4 address or a domain name", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "885943bf-c35a-4266-834d-a5b474f90a13", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Open HTTP Redirect", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where (url.query rlike \"(.*)http(s?)(.*)\" or url.query rlike \"(.*)(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])\\\\.(?:25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9][0-9]|[0-9])(.*)\" or url.query rlike \".*\\\\.(com|net|org|gov|edu|io|dev|arpa|local|test|home|biz|info|co|us|uk|de|fr|jp|ca|au|nz|eu|cn|in)/(.*)|.*\\\\.(com|net|org|gov|edu|io|dev|arpa|local|test|home|biz|info|co|us|uk|de|fr|jp|ca|au|nz|eu|cn|in)\") and (http.response.status_code in (302, 307))\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, host.name, source.ip\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "885943bf-c35a-4266-834d-a5b474f90a13", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}