title: Base Rule - Web Apache Correlation Directory Enumeration
id: e3dcf14e-7da1-4660-9c66-2b85f46db4b0
status: experimental
name: base_rule_web_apache_correlation_directory_enumeration
description: Detects an attempt to enumerate a webserver by the method and response code
author: Dylan Shield (Shieldia.co)
date: 2025-03-20
modified: 2025-04-11
tags:
    - attack.reconnaissance
    - attack.t1595.002
logsource:
    product: apache
    service: access
    category: webserver
detection:
    selection:
      method: "GET"
      status: 404
    condition: selection
level: low
---
title: Web Apache Correlation Directory Enumeration
id: 289a3330-7141-4117-8691-3db7c7e69364
status: experimental
name: web_apache_correlation_directory_enumeration
description: |
    Correlation rule to detect directory enumeration by the number of 404 responses from a single source to a single destination
author: Dylan Shield (Shieldia.co)
date: 2025-03-20
modified: 2025-04-11
tags:
  - attack.reconnaissance
  - attack.t1595.001
logsource:
    product: apache
    service: access
    category: webserver
correlation:
    type: value_count
    rules:
    - base_rule_web_apache_correlation_directory_enumeration
    group-by:
        - clientip
        - host
    timespan: 5m
    condition:
        gte: 1000
        field: url
falsepositives:
  - Unlikely
level: low
---
title: Threat Hunt - Web Apache Correlation Directory Enumeration
id: a8aa9af9-c3ea-4fb9-999b-a6fcb0d53abd
status: experimental
name: threat_hunt_web_apache_correlation_directory_enumeration
description: |
    Correlation rule to detect directory enumeration by the number of 404 responses from a single source to a single destination
author: Dylan Shield (Shieldia.co)
date: 2025-03-20
modified: 2025-04-11
tags:
  - attack.reconnaissance
  - attack.t1595.001
logsource:
    product: apache
    service: access
    category: webserver
correlation:
    type: value_count
    rules:
    - base_rule_web_apache_correlation_directory_enumeration
    group-by:
        - clientip
        - host
    timespan: 1d
    condition:
        gte: 200
        field: url
falsepositives:
  - Unlikely
level: low