{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects PHP Stream attempts\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "5aee434b-fdc7-4a07-8d69-ea30cffac397", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - PHP Stream Med Sec", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where url.query rlike \".*data://.*\" or url.query rlike \".*file://.*\" or url.query rlike \".*ftp://.*\" or url.query rlike \".*php://*\" or url.query rlike \".*zlib://.*\" or url.query rlike \".*glob://.*\" or url.query rlike \".*phar://.*\" or url.query rlike \".*ssh2://.*\" or url.query rlike \".*rar://.*\" or url.query rlike \".*ogg://.*\" or url.query rlike \".*expect://.*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": ["https://www.php.net/manual/en/wrappers.php"], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "5aee434b-fdc7-4a07-8d69-ea30cffac397", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}
