{"actions": [], "author": ["Subhash Popuri (@pbssubhash), Florian Roth (Nextron Systems), Thurein Oo, Nasreddine Bencherchali (Nextron Systems), Dylan Shield (Shieldia.co)"], "description": "Detects path traversal exploitation attempts\n", "enabled": true, "exceptions_list": [], "false_positives": ["Expected to be continuously seen on systems exposed to the Internet", "Internal vulnerability scanners"], "from": "now-9m", "id": "0a5ed72a-a429-44bc-b917-b6f9c0540851", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Path Traversal Exploitation Attempts Med Sec", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where url.query rlike \".*etc/+passwd.*\" or url.query rlike \".*etc[%2f]+passwd.*\" or url.query rlike \".*var/+log.*\" or url.query rlike \".*var[%2f]+log.*\" or url.query rlike \".*var/+lib.*\" or url.query rlike \".*var[%2f]+lib.*\" or url.query rlike \".*var/+www.*\" or url.query rlike \".*var[%2f]+www.*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(url.query) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": ["https://github.com/projectdiscovery/nuclei-templates", "https://book.hacktricks.xyz/pentesting-web/file-inclusion"], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "0a5ed72a-a429-44bc-b917-b6f9c0540851", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}
