title: Base Rule - Cross Site Scripting Strings
id: 4d35b3d7-82ce-4592-b601-8b7ac155c7d1
related:
    - id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
      type: similar
status: experimental
description: Detects XSS attempts injected via GET requests in access logs
name: base_rule_xss_strings_in_uri
references:
    - https://github.com/payloadbox/xss-payload-list
    - https://portswigger.net/web-security/cross-site-scripting/contexts
author: Saw Win Naung, Nasreddine Bencherchali, Dylan Shield (Shieldia.co)
date: 2021-08-15
modified: 2025-04-09
tags:
    - attack.initial-access
    - attack.t1189
logsource:
    category: webserver
    product: apache
    service: access
detection:
    selection:
        cs-method:
            - 'GET'
        uri-query|contains:
            - '=<script>'
            - '</script>'
            - '=%3Cscript%3E'
            - '=%253Cscript%253E'
            - '<iframe '
            - '%3Ciframe '
            - '<svg '
            - '%3Csvg '
            - 'document.cookie'
            - 'document.domain'
            - ' onerror='
            - ' onresize='
            - ' onload="'
            - 'onmouseover='
            - '${alert'
            - 'javascript:alert'
            - 'javascript%3Aalert'
    filter:
        sc-status: 404
    condition: selection and not filter
falsepositives:
    - JavaScripts,CSS Files and PNG files
    - User searches in search boxes of the respective website
    - Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as "User Agent" strings and more response codes
level: high
---
title: Cross Site Scripting Strings
id: 3dc5b535-a209-4654-bf9e-239f2b21d7f4
status: experimental
name: sqli_strings_in_uri
description: |
    Detects potential XSS attempts via GET requests in access logs.
references:
    - https://github.com/payloadbox/xss-payload-list
    - https://portswigger.net/web-security/cross-site-scripting/contexts
author: Saw Win Naung, Nasreddine Bencherchali, Dylan Shield (Shieldia.co)
date: 2025-04-09
tags:
    - attack.initial-access
    - attack.t1189
logsource:
    category: webserver
    product: apache
    service: access
correlation:
    type: value_count
    rules:
    - base_rule_xss_strings_in_uri
    group-by:
        - clientip
        - host
    timespan: 5m
    condition:
        gte: 1
        field: uri-query
falsepositives:
    - JavaScripts,CSS Files and PNG files
    - User searches in search boxes of the respective website
    - Internal vulnerability scanners can cause some serious FPs when used, if you experience a lot of FPs due to this think of adding more filters such as "User Agent" strings and more response codes
level: high