title: Base Rule - Web Apache Correlation Directory Enumeration Med Sec
id: 9a46efd2-7992-46e6-b3ad-704c780227a0
status: experimental
name: base_rule_web_apache_correlation_directory_enumeration_med_sec
description: Detects an attempt to enumerate a webserver by the method and response code, removed GET selection filter
author: Dylan Shield (Shieldia.co)
date: 2025-07-06
tags:
    - attack.reconnaissance
    - attack.t1595.002
logsource:
    product: apache
    service: access
    category: webserver
detection:
    selection:
      status: 404
    condition: selection
level: low
---
title: Web Apache Correlation Directory Enumeration Med Sec
id: ae6b1e99-4bee-4ef7-930e-ce7d32ce38c8 
status: experimental
name: web_apache_correlation_directory_enumeration_med_sec
description: |
    Correlation rule to detect directory enumeration by the number of 404 responses from a single source to a single destination removed GET selection
author: Dylan Shield (Shieldia.co)
date: 2025-07-06
tags:
  - attack.reconnaissance
  - attack.t1595.001
logsource:
    product: apache
    service: access
    category: webserver
correlation:
    type: value_count
    rules:
    - base_rule_web_apache_correlation_directory_enumeration_med_sec
    group-by:
        - clientip
        - host
    timespan: 5m
    condition:
        gte: 1000
        field: url
falsepositives:
  - Unlikely
level: low
---
title: Threat Hunt - Web Apache Correlation Directory Enumeration Med Sec
id: 6f400bb8-bb8b-40a2-9c03-9284b3e546ff 
status: experimental
name: threat_hunt_web_apache_correlation_directory_enumeration_med_sec
description: |
    Correlation rule to detect directory enumeration by the number of 404 responses from a single source to a single destination
author: Dylan Shield (Shieldia.co)
date: 2025-07-06
tags:
  - attack.reconnaissance
  - attack.t1595.001
logsource:
    product: apache
    service: access
    category: webserver
correlation:
    type: value_count
    rules:
    - base_rule_web_apache_correlation_directory_enumeration_med_sec
    group-by:
        - clientip
        - host
    timespan: 1d
    condition:
        gte: 200
        field: url
falsepositives:
  - Unlikely
level: low
