{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detects File Inclusion attempts in apache error logs\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "dc8e43d1-3103-4fd9-8eb8-1a150a474c3b", "immutable": false, "index": ["logs-apache.error-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Error Correlation File Inclusion", "note": "", "output_index": "", "query": "from logs-apache.error-default metadata _id, _index, _version | where message like \"*Failed opening*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(message) by timebucket, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "dc8e43d1-3103-4fd9-8eb8-1a150a474c3b", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}
