{"actions": [], "author": ["Florian Roth (Nextron Systems), Dylan Shield (Shieldi.co)"], "description": "Correlation rule to detect suspicius User-Agnets in Apache Web Server logs from a single source to a single destination\n", "enabled": true, "exceptions_list": [], "false_positives": ["Unlikely"], "from": "now-9m", "id": "6b5a3259-9381-46e4-a507-bd45bb5e9d28", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation Hack Tool User Agent", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where user_agent.original like \"*Nmap Scripting Engine*\" or user_agent.original like \"*Fuzz Faster U Fool*\" or user_agent.original like \"*OpenVAS*\" or user_agent.original like \"*Nikto*\" or user_agent.original like \"*Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36*\" or user_agent.original like \"*(hydra)*\" or user_agent.original like \"* arachni/*\" or user_agent.original like \"* BFAC *\" or user_agent.original like \"* brutus *\" or user_agent.original like \"* cgichk *\" or user_agent.original like \"*core-project/1.0*\" or user_agent.original like \"* crimscanner/*\" or user_agent.original like \"*datacha0s*\" or user_agent.original like \"*DirBuster*\" or user_agent.original like \"*domino hunter*\" or user_agent.original like \"*dotdotpwn*\" or user_agent.original like \"*FHScan Core*\" or user_agent.original like \"*floodgate*\" or user_agent.original like \"*get-minimal*\" or user_agent.original like \"*gootkit auto-rooter scanner*\" or user_agent.original like \"*grendel-scan*\" or user_agent.original like \"* inspath *\" or user_agent.original like \"*internet ninja*\" or user_agent.original like \"*jaascois*\" or user_agent.original like \"* zmeu *\" or user_agent.original like \"*masscan*\" or user_agent.original like \"* metis *\" or user_agent.original like \"*morfeus fucking scanner*\" or user_agent.original like \"*n-stealth*\" or user_agent.original like \"*nsauditor*\" or user_agent.original like \"*pmafind*\" or user_agent.original like \"*security scan*\" or user_agent.original like \"*springenwerk*\" or user_agent.original like \"*teh forest lobster*\" or user_agent.original like \"*toata dragostea*\" or user_agent.original like \"* vega/*\" or user_agent.original like \"*voideye*\" or user_agent.original like \"*webshag*\" or user_agent.original like \"*webvulnscan*\" or user_agent.original like \"* whcc/*\" or user_agent.original like \"* Havij*\" or user_agent.original like \"*absinthe*\" or user_agent.original like \"*bsqlbf*\" or user_agent.original like \"*mysqloit*\" or user_agent.original like \"*pangolin*\" or user_agent.original like \"*sql power injector*\" or user_agent.original like \"*sqlmap*\" or user_agent.original like \"*sqlninja*\" or user_agent.original like \"*uil2pn*\" or user_agent.original like \"*ruler*\" or user_agent.original like \"*Mozilla/5.0 (Windows; U; Windows NT 5.1; pt-PT; rv:1.9.1.2) Gecko/20090729 Firefox/3.5.2 (.NET CLR 3.5.30729)*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(user_agent.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 50, "risk_score_mapping": [], "rule_id": "6b5a3259-9381-46e4-a507-bd45bb5e9d28", "setup": "", "severity": "medium", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0043", "name": "Reconnaissance", "reference": "https://attack.mitre.org/tactics/TA0043"}, "technique": [{"id": "T1595", "name": "Active Scanning", "reference": "https://attack.mitre.org/techniques/T1595", "subtechnique": [{"id": "T1595.002", "name": "Vulnerability Scanning", "reference": "https://attack.mitre.org/techniques/T1595/002"}]}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}, {"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0006", "name": "Credential-Access", "reference": "https://attack.mitre.org/tactics/TA0006"}, "technique": [{"id": "T1110", "name": "Brute Force", "reference": "https://attack.mitre.org/techniques/T1110", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}