{"actions": [], "author": ["Dylan Shield (Shieldia.co)"], "description": "Detect User-Agent based Cross Site Scripting attempt in webserver logs", "enabled": true, "exceptions_list": [], "false_positives": ["Unknown"], "from": "now-9m", "id": "000e7a6d-9807-4c85-80b8-5d6e76ceb05f", "immutable": false, "index": ["logs-apache.access-default"], "interval": "5m", "language": "esql", "license": "DRL 1.1", "max_signals": 100, "meta": {"from": "1m"}, "name": "SIGMA - Web Apache Correlation XSS in User-Agent Attempt", "note": "", "output_index": "", "query": "from logs-apache.access-default metadata _id, _index, _version | where user_agent.original like \"*\u003cscript\u003e*\" or user_agent.original like \"*\u003c/*\" or user_agent.original like \"*alert(*\"\n| eval timebucket=date_trunc(5minutes, @timestamp) | stats value_count=count_distinct(user_agent.original) by timebucket, source.ip, host.name\n| where value_count \u003e= 1", "references": [], "related_integrations": [], "required_fields": [], "risk_score": 75, "risk_score_mapping": [], "rule_id": "000e7a6d-9807-4c85-80b8-5d6e76ceb05f", "setup": "", "severity": "high", "severity_mapping": [], "tags": [], "threat": [{"framework": "MITRE ATT\u0026CK", "tactic": {"id": "TA0001", "name": "Initial-Access", "reference": "https://attack.mitre.org/tactics/TA0001"}, "technique": [{"id": "T1190", "name": "Exploit Public-Facing Application", "reference": "https://attack.mitre.org/techniques/T1190", "subtechnique": []}]}], "to": "now", "type": "esql", "version": 1}